## Data Transformation

### Removing Duplicates

In [2]:
import pandas as pd

data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

- __The DataFrame method 'duplicated' returns a boolean Series indicating whether each row is a duplicate (has been observed in a previous row) or not:__

In [4]:
# is duplicate

data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

- __Let's remove duplicate parts__

In [6]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

### Transforming Data Using a Function or Mapping

In [7]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

- __Let's say you wanted to add column that indicate the type of animal that each food come from. Let's write down mapping of each distinct meat type to kind of animal:__

In [8]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

- __The 'map' method on a Series accepts a function or dict-like object containing a mapping, but here we have a small problem in that some of the meats are capitalized and others are not. Thus, we need to convert each value to lowercase using the 'str.lower' Series method:__

In [9]:
lowercased_food = data['food']
lowercased_food

0          bacon
1    pulled pork
2          bacon
3       Pastrami
4    corned beef
5          Bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [10]:
data['animal'] = lowercased_food.map(meat_to_animal)

In [13]:
#Now let's check data

data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     NaN
4  corned beef     7.5     cow
5        Bacon     8.0     NaN
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### Replacing values

- __Filling in missing data with the fillna method is a special case of more general value
replacement. As you’ve already seen, map can be used to modify a subset of values in
an object but replace provides a simpler and more flexible way to do so__

In [14]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

- __Let's use replace method__

In [22]:
data.replace(-999., 999)

0       1.0
1     999.0
2       2.0
3     999.0
4   -1000.0
5       3.0
dtype: float64

In [23]:
data.replace([1,2],[11,22])

0      11.0
1    -999.0
2      22.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

### Renaming Axis Indexes

- __We can also transformed the axis lable by using the mapping function without producing new labled objects. We can also modify the axis without creating or producing new data structure__

In [24]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four']
                   )
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

- __Like a Series, the axis indexes have a map method:__

In [26]:
transform = lambda x: x.upper()
data.index.map(transform)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [28]:
data.columns.map(transform)

Index(['ONE', 'TWO', 'THREE', 'FOUR'], dtype='object')

- __You can assign to index , modifying the DataFrame in-place:__

In [29]:
data.index = data.index.map(transform)
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

- __If you want to create a transformed version of a dataset without modifying the original, a useful method is rename :__

In [33]:
data.rename(index=str.upper, columns=str.upper)

          ONE  TWO  THREE  FOUR
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

- __We can also rename column name__

In [34]:
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

### Discretization and Binning

- __Let's say you data about the group of people in the study and your want to put them into groups into dscrete age buckets__

In [3]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

- __Let's deivde these into group 18-25, 26-35, 36-60__
- __for this we will use 'cut' method of pandas__

In [1]:
bins = [18, 25, 35, 60, 100]

[18, 25, 35, 60, 100]

In [4]:
import pandas as pd

cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [20]:
# let's find categories

cats.categories

IntervalIndex([(-3.878, -2.09], (-2.09, -0.309], (-0.309, 1.473], (1.473, 3.254]],
              closed='right',
              dtype='interval[float64]')

In [7]:
#couunt values in that range

pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

- __another example__

In [9]:
import numpy as np

data = np.random.rand(20)
data

array([0.50524027, 0.82536114, 0.87897729, 0.95991592, 0.00462971,
       0.03265415, 0.37242904, 0.82340564, 0.79455816, 0.34849283,
       0.68462261, 0.68924725, 0.78371243, 0.84116093, 0.912038  ,
       0.13426596, 0.50474311, 0.43686343, 0.3587991 , 0.29840108])

- __we can pass an integer number of bins to cut instead of explicit bin edges__

In [11]:
pd.cut(data,4,precision=2)

[(0.48, 0.72], (0.72, 0.96], (0.72, 0.96], (0.72, 0.96], (0.0037, 0.24], ..., (0.0037, 0.24], (0.48, 0.72], (0.24, 0.48], (0.24, 0.48], (0.24, 0.48]]
Length: 20
Categories (4, interval[float64]): [(0.0037, 0.24] < (0.24, 0.48] < (0.48, 0.72] < (0.72, 0.96]]

- __Another example__

In [12]:
data = np.random.randn(1000)
data

array([-0.28329751,  0.69647383,  0.50932473, -0.19788467,  0.3805382 ,
        0.79857702, -0.39722477, -1.15207044, -0.31161365,  1.32508242,
       -1.43234083, -0.859545  , -0.84025562, -0.34535447, -0.63715876,
       -0.28001133, -2.72469632,  1.09097762,  0.08838981, -0.01332076,
        0.6081183 ,  0.1504571 , -1.27992839,  0.80678876,  0.14207136,
       -0.12238775,  0.10154687, -1.48925138,  1.10591033,  0.34753241,
        0.62966578, -2.02831419,  1.05901848,  0.52347709,  0.57545962,
       -0.47828719, -0.86736387,  0.88996649, -1.23015075,  0.68688127,
       -0.77093433, -0.91926497,  1.23646628,  0.09595641,  2.26254434,
        2.05952892,  0.29047633,  0.42038511,  1.73783325,  0.10718633,
       -0.20088158, -2.04345659, -0.37325266,  0.22527216, -0.50674888,
       -1.164767  ,  0.17728947,  0.43819735, -0.52788876, -0.4102603 ,
       -0.57712589,  1.3416967 ,  0.10667698, -1.68010006, -1.14046142,
       -0.48153535, -1.52800811, -1.98560062,  0.2916103 , -1.85858274,
       -1.00065665, -2.06049247,  0.56595998, -1.22454941,  0.4148255 ,
       -0.93945033, -1.84810209, -0.45851891,  1.28533557, -0.54536498,
       -0.72787897,  0.57488301,  0.1499027 , -0.59648448,  1.38164774,
        0.02981922, -0.992711  , -1.29201173, -0.38631674, -0.75582031,
        1.52652292,  0.40182422,  0.25051646,  0.49396238,  0.09189513,
        1.58905092,  0.752374  ,  0.00585766, -0.50007938,  0.51139195,
       -0.1875399 , -0.01381383, -0.45387414, -2.38960226,  0.52374955,
       -1.5439668 , -0.4984249 , -0.25886365,  1.53141965, -0.86083972,
        1.14705002, -1.03487994,  0.05708326, -0.05417318, -1.05996563,
       -0.89590913,  0.23501803,  0.52854168, -1.01869354,  0.48739653,
        0.15681387,  0.46115582, -0.06180434, -0.21767857, -1.58035058,
       -0.11296835,  0.63114027,  0.1014285 ,  0.38482355,  0.86530448,
        0.59885578,  0.25283177,  1.46362462,  0.37584949,  2.12301779,
        1.68795469, -0.84483499, -0.00629508,  0.91561687,  1.30380495,
       -0.60920016,  0.05132006,  0.73565235, -0.10464723, -2.09819958,
       -0.30591555,  2.15867423, -1.38023234,  0.55351481, -0.5381031 ,
        1.60192128, -2.83990468, -1.15948214, -1.51861596, -1.74896341,
        0.01200648,  1.43210371, -0.75895993, -0.25481435, -0.36566501,
       -1.08821608, -0.32102921, -0.16391188,  0.51754127,  0.88611444,
        0.25802367,  0.09390857,  0.83518371,  2.10580256, -0.04074026,
        1.13058405, -1.40499559,  1.79351909,  0.7751112 , -0.68226984,
        0.10771373,  0.84037741, -0.2047594 , -0.38095688,  0.03674831,
       -0.43694975, -0.2499311 , -1.11285687,  0.68271489, -0.60301928,
       -0.48307282, -0.07186287, -0.59715485,  0.04714099, -0.53411362,
       -0.96989834, -0.89837499, -1.3009244 , -0.81424823,  1.22274925,
        0.18993132, -0.13161396,  0.57601471,  0.18421187,  0.24165135,
        0.13866789, -1.06539695,  1.71895357,  1.11526593, -0.54951744,
       -1.18198417, -0.8510202 ,  0.11424312, -0.62519105, -0.5173651 ,
        0.15535688, -1.81917288,  1.24549429, -2.02939947, -0.21633187,
       -0.39422765,  0.04100552,  0.69425064,  0.0170659 ,  1.18490672,
       -0.26187234,  0.03721591, -0.3612822 , -0.17011173,  1.4422233 ,
       -1.00234389, -0.89606938,  0.56469479,  1.69985817,  1.22431528,
        0.81737572, -0.36227628,  1.39778151, -1.22091082, -1.99288822,
        2.16541476,  0.520639  , -0.33105148,  0.08028827, -1.23888216,
        1.26889402,  0.15196159, -1.8066859 ,  0.04228295, -1.40279009,
       -0.06677418,  0.4085927 , -0.76471428, -0.06839532, -1.03737692,
        0.77784535, -0.21800756, -0.06458071,  1.53159238, -0.16751332,
       -1.19281582,  0.20464542,  0.02281405, -1.5641069 ,  0.49197631,
       -0.90009674,  2.87414039, -0.09665456,  0.253234  ,  0.56658053,
        1.21046459,  0.83475857, -0.37297946,  0.09882828, -0.1238973 ,
        0.45794196,  0.84006832, -0.01529911, -1.32426306,  0.50479052,
        0.82251492,  0.15845219,  0.19616216, -0.28170538, -0.26618532,
       -0.22885577, -0.27150439,  1.43986314,  0.07975754,  1.78203639,
       -0.87392678, -0.69961714, -0.36266484, -0.9057601 , -0.21198825,
        0.61677186,  0.13022756,  0.42968295,  1.02863916, -0.34135447,
        1.30011104,  0.07499873, -0.20540488, -0.92793255,  0.45805188,
       -0.51366419, -0.57314372,  1.48730381, -0.34055197, -1.23115576,
       -1.55811138,  0.09808467, -1.69847481,  0.18329393,  0.70266406,
       -0.09558148,  0.49605413, -0.87865998,  0.16303148, -0.9900675 ,
       -0.44166557,  1.22253957, -1.30002427,  1.12239263, -0.2560406 ,
        0.4035778 ,  0.37457234, -1.01071107,  0.30767401, -1.31733321,
        1.10498853,  0.24075923, -0.20816675, -1.10351509, -0.30466222,
        1.91822673, -1.16983598,  0.36568784,  1.16347647,  0.02765968,
       -1.13548606,  1.36840428,  0.34919684, -1.04315721, -0.66725668,
        0.33509006, -0.61154519, -0.10960767, -0.6716293 , -0.6169657 ,
        0.27052354, -0.32128862, -0.72199398, -0.45341483, -0.13470715,
        0.62227766, -1.38973058,  0.95786728, -1.00951943,  0.01790412,
        0.20094411, -0.92971666, -0.49019904,  1.89084577,  1.88482682,
        3.00596958,  0.49798259, -0.50065416,  0.79193259,  0.89158738,
       -1.17205802,  0.576518  ,  0.43793438, -0.12708227,  0.27536598,
       -0.32317779, -0.16570114, -0.84858421, -0.14379309, -0.88252731,
        0.76098002, -0.20264781, -0.51006722,  0.80654579,  0.20678739,
       -0.60598305, -0.34142244,  0.48414248,  0.42586482,  0.81401852,
       -1.50175963,  0.61494445, -0.0828253 ,  0.04022747, -0.81263189,
        0.8224215 ,  0.2568163 , -0.62360511, -0.64980837, -0.25559469,
       -0.69756737, -0.4897491 ,  0.92362736, -1.26543579,  0.81903842,
       -0.8671316 ,  0.17319783, -2.09306281, -0.31079172, -1.62667378,
        1.09674   ,  0.03517361, -1.25286692, -1.12031703, -1.21122857,
       -0.21661403,  1.47148937,  1.06171163,  1.06561866,  1.52970886,
        0.44374049, -1.13585721, -0.5612828 , -0.37828264,  0.1194233 ,
        1.23721937, -0.36592056, -1.01447973, -0.09679091,  0.06217841,
       -1.83759737,  2.60995536,  0.7343586 , -0.31589861, -0.57084402,
       -0.34792433,  0.81093844,  0.3563354 ,  0.11338663,  0.7961799 ,
        0.58378052, -0.07549237,  1.26400256,  0.35318203, -0.13630745,
       -0.03382754,  0.74739925,  1.53508635, -1.99406566, -1.39901587,
       -0.46090405,  0.01758724, -0.30811063,  0.80102634,  0.02137476,
        0.52504595, -1.21573783,  1.19348855,  0.18589694, -0.64846121,
       -0.42063863,  0.26472539,  1.37245824,  2.23486472, -0.28800464,
       -2.17448743,  0.86023191,  0.78595848,  0.92609175,  0.81988298,
       -1.6573856 , -1.50768145,  0.32980752,  2.1290755 ,  0.0195716 ,
        0.63744324,  0.47516424,  2.41157253, -0.01807086,  0.94136691,
       -0.87037847,  0.67779174,  1.2052566 , -1.1399331 , -1.17822952,
        0.43344092, -1.4430223 ,  0.38739046, -0.78300972, -0.60579144,
       -1.47290109,  1.61962919, -0.3949509 , -1.61350961, -1.15369896,
       -0.21964315, -0.11185311,  0.12515944,  0.07250144,  1.454766  ,
        0.84675007,  1.0481038 ,  0.22414452, -0.09886254,  0.91350288,
       -0.22284455, -0.46778067,  1.53246804,  0.28929117, -0.77515419,
        0.60749684, -0.3788697 , -1.49330156, -1.07897488, -0.28587866,
       -1.26225446,  0.22064001, -1.54905291, -0.48802993, -0.18521262,
        1.40194188, -0.96766382,  1.55566938,  0.82093141, -0.63583332,
        0.7710265 ,  3.25399528,  0.73548769, -1.37641541, -0.0675771 ,
       -0.51184433,  1.15961125,  0.99788012, -0.31992702, -1.15573971,
        0.05116662,  1.91097373,  0.48622938, -0.46532948,  0.99289689,
        0.52788207,  1.1141476 ,  0.22137732,  0.77462922, -1.08116407,
       -1.24020516, -0.24724472, -0.16872784,  0.2200304 ,  0.79472968,
       -0.15357279,  0.23840289,  0.33911794, -1.36774646, -0.2360484 ,
       -0.59116139, -0.14282527, -0.05203562,  1.25884655, -0.93881237,
       -0.09019849,  1.80784736, -0.58036757, -0.85539765,  0.48098089,
       -1.50816102, -0.89593242,  1.62043791,  0.09940148,  0.96551055,
        0.36509219,  0.95437476, -0.12824245, -0.89871128, -0.10045202,
        1.8100976 , -1.14169189, -0.09903829,  0.72316925, -0.47245266,
        0.10667616,  1.4943191 , -1.19102454, -0.20651981,  2.75057751,
        0.11473835, -1.0686312 ,  0.62183336,  0.03272426,  0.25705947,
        0.5854428 ,  1.26192725,  1.21437626,  0.86140493,  0.75823713,
       -0.9425914 ,  0.21146505,  1.63360193, -0.02386779, -0.97586915,
       -0.41590359,  0.71253672,  1.07049688, -0.50390908, -2.43763889,
       -1.09850847,  1.09014891,  0.26750022, -0.96513301, -0.53321721,
        0.08104467,  0.56110758,  0.95453363, -0.808398  ,  2.01020792,
        0.54142262,  1.05910545,  0.10559807,  2.7631592 , -0.03786329,
       -0.2709927 ,  1.0391816 ,  0.25683051,  0.58249761, -0.86995902,
       -0.25506468, -0.44898963,  1.19229119,  1.05206398, -0.33888271,
       -0.941865  , -0.45520822,  1.46508085, -0.16744201, -1.09471383,
       -0.6494641 ,  2.58085832,  0.13364357,  0.60453044, -1.82116077,
        1.63938461,  0.36984109,  0.15453797,  0.23677668, -0.399653  ,
       -0.42608891, -0.05061417, -0.27887343, -0.86628548, -0.30153463,
       -0.19625182,  0.1931097 ,  0.04380599,  1.16559553,  0.51690473,
        0.1555028 ,  0.07165405,  0.25256949,  0.98533407, -1.0952521 ,
       -1.2501552 ,  0.8695375 ,  0.2888849 ,  0.34428169, -1.56754736,
        1.94691228, -0.6261797 , -0.26523943, -0.54821924, -1.36514805,
       -0.57095815, -0.68877995, -1.88916396, -1.77888212,  0.34747432,
        1.6328694 , -0.50103982,  2.48678457,  1.33429006,  0.58980881,
       -2.63187894, -0.5247393 , -0.42047094, -0.79320108,  0.38500599,
        0.6327642 ,  1.15080024, -0.03598647,  0.60599495,  0.43976038,
       -2.22087907,  0.7517922 ,  0.20441988, -0.93367365,  0.68674944,
        1.35174136,  1.46269648, -0.37426683,  0.82885361, -1.53196407,
        0.24126069,  0.17208724,  1.65732488, -0.11490934,  1.18740571,
       -0.10607039, -0.46524428, -0.22415701, -1.63034264,  0.71327214,
        0.4720629 , -1.19018929,  0.48986571, -1.07343153, -1.32762142,
       -1.68442638,  0.7886512 , -0.2068736 , -0.7133908 , -3.8710324 ,
       -0.9190124 ,  0.02695948, -1.06312668, -1.43487116, -0.39925087,
        0.31178868, -0.71378026, -2.44503977, -0.80491037, -0.46772598,
       -0.91554644,  0.0758126 ,  1.51867485, -0.38220515,  1.78462691,
       -0.42804239,  2.51742259, -1.4569598 ,  0.17088819, -0.56947887,
       -0.16619768, -0.28757544,  1.40980712,  0.1830469 ,  0.91642695,
        0.23839428, -0.67289019,  1.27714166, -1.03679814, -0.68229547,
       -0.52563231,  1.1588448 ,  0.29031322,  0.51623644, -0.4121911 ,
        0.00794153, -0.26864646,  0.26098542,  0.52452519, -0.03748144,
        0.54110923,  1.49962594,  0.13828329,  1.3013579 , -1.59115821,
        0.99317497, -0.22485566,  0.22874492,  0.10849726,  0.61046518,
       -0.18921851,  0.82938558,  1.14052625,  2.43227176,  0.29244292,
       -0.58372771, -0.96675162,  1.59620051, -1.10579079,  0.11785142,
        1.39711695, -1.25732778, -1.48306219, -2.63598996, -0.01017282,
        0.21042466, -1.20519234,  0.97649257,  0.44832193, -0.41877074,
        0.69855925,  0.67570069, -0.90228747,  0.82614444, -0.03310163,
        0.62386768, -1.30862362, -1.2605444 ,  1.13383317, -0.03757405,
       -1.76355383,  0.65876182,  1.71300846, -0.65819787, -0.51560052,
       -0.88475669, -2.15960577, -1.54751655, -0.79681295, -0.54259943,
       -0.25175253, -0.14161643, -1.032962  , -0.91437634,  0.86072014,
        0.10171672,  0.43858487,  0.59086671, -0.56030861,  0.34002039,
        0.93997705,  1.22903364,  1.07673901,  0.49193248,  0.12655399,
        0.624042  ,  1.00184297,  1.35096373,  1.16270227,  0.3252622 ,
       -1.48815319,  0.66111898,  0.15548739,  0.11844892,  0.99655137,
       -1.29142246,  0.87211234,  0.19261607, -0.41209517,  0.25569879,
        1.33365949,  1.61723098,  0.81732075,  0.67227102,  1.07288542,
        1.00192916, -0.67906919, -0.13928218,  1.79468638, -0.01474507,
        0.90912825,  0.10930086,  0.65602366,  2.47202413,  1.34280163,
       -0.06514795, -0.62311637, -0.52129135,  0.538456  , -0.67180665,
        0.70482666, -2.52386197, -0.45788559, -1.29206209,  0.91714195,
       -0.16395862, -1.11911804, -0.16282872, -1.14808431,  0.72312626,
        0.26557067, -0.14272945, -0.05076859,  0.66596021,  0.64178419,
        0.75449959,  1.0839004 , -0.06376833, -1.65198232, -0.49874845,
        1.4578587 ,  2.56057484,  0.44621608,  0.17425496,  0.15648681,
       -0.93624939,  0.10424149, -1.03332388, -0.75286063, -1.13947555,
       -1.07042937, -0.46864147, -0.12028383,  1.32532195,  1.12335936,
        0.26221293,  0.89456066, -0.19480554, -1.70924956, -0.88310542,
        1.00566346,  0.00883002, -0.9138501 ,  1.17956719, -0.04914173,
        0.78943086, -0.22500648,  1.17607183,  0.58230256, -0.00664685,
        0.05160926, -1.21926887, -0.06178673,  1.28845972,  1.09038435,
        1.58932658, -0.40896521, -0.40910164, -0.47636424, -2.34986722,
        0.18928714, -0.72205332, -0.61159322,  0.59428866,  0.08435423,
        0.42480929, -1.22956645,  1.02816711,  1.06632059, -1.33509914,
       -0.50290188, -1.31252946,  0.27445757,  0.39263939, -1.02685998,
       -1.82641224, -0.23287713, -1.35937683,  0.92697392,  1.45318774,
        0.99742327, -0.70301884,  0.24066   , -0.7934361 ,  0.28406851,
       -0.48758833, -0.33385272,  1.04045036,  0.69538627, -1.66471795,
       -0.41378277,  1.91802643,  0.40522336,  0.50608198, -0.47429981,
       -0.07644304, -1.3179184 , -0.04045804, -0.65060063,  0.25476413,
        0.11525192,  0.67344617,  1.56110087, -0.53605419, -0.06089213,
        0.27916545, -1.0567744 , -0.18541064,  0.3140407 , -2.27716933,
       -1.0002399 , -0.31107619, -0.01830518,  0.02105244, -0.90759235,
       -0.49173853, -0.77434656, -0.72948588, -1.37481184, -0.56069668,
        0.26156482, -0.47880332,  0.24204812, -0.27573256, -2.42233811,
        0.24530744, -1.13144139,  0.54420812, -1.466574  , -2.33751717,
       -1.54450704, -0.77295714,  1.09600865,  1.37315984, -1.10657184,
        0.1584016 , -0.6019525 ,  0.52156582, -0.85072623,  0.81459752,
        0.41501115,  2.10773985, -1.30491137,  1.25095076,  0.77359639])

In [14]:
cats = pd.cut(data,4)
cats

[(-0.309, 1.473], (-0.309, 1.473], (-0.309, 1.473], (-0.309, 1.473], (-0.309, 1.473], ..., (-0.309, 1.473], (1.473, 3.254], (-2.09, -0.309], (-0.309, 1.473], (-0.309, 1.473]]
Length: 1000
Categories (4, interval[float64]): [(-3.878, -2.09] < (-2.09, -0.309] < (-0.309, 1.473] < (1.473, 3.254]]

In [15]:
pd.value_counts(cats)

(-0.309, 1.473]    563
(-2.09, -0.309]    356
(1.473, 3.254]      63
(-3.878, -2.09]     18
dtype: int64

### Detecting and Filtering Outliers
- __Filtering or transforming outliers is largely a matter of applying array operations.__

In [16]:
data = pd.DataFrame(np.random.randn(1000, 4))
data

            0         1         2         3
0    0.739944  0.094338  0.361905  0.475463
1   -0.182451  2.482996  2.190688 -0.131998
2    0.453916 -0.604206 -1.056480 -1.363392
3   -1.454186  1.175676 -1.018282  0.003432
4   -0.588149  1.129856 -0.865058 -1.303113
..        ...       ...       ...       ...
995  0.704879 -0.069154  0.585960  1.325228
996  1.303773 -0.449581 -1.290746  1.483015
997 -0.486026  0.973949  0.318537 -1.849429
998  0.162705 -1.735722  0.219019  1.209766
999  0.837424 -0.318336 -0.055143 -0.639957

[1000 rows x 4 columns]

In [18]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.054164    -0.023482    -0.001122     0.010325
std       1.022017     1.034671     0.930680     1.030806
min      -2.864327    -3.307033    -3.331742    -3.133937
25%      -0.713493    -0.710143    -0.603772    -0.663430
50%      -0.049706    -0.051692    -0.006663     0.013526
75%       0.654988     0.654663     0.593711     0.726343
max       3.325734     3.411398     2.578913     2.817692

- __Let's say you want to find value in one of the columns exceeding in 3 absolute values__

In [22]:
col = data[2]
col

0      0.361905
1      2.190688
2     -1.056480
3     -1.018282
4     -0.865058
         ...
995    0.585960
996   -1.290746
997    0.318537
998    0.219019
999   -0.055143
Name: 2, Length: 1000, dtype: float64

In [23]:
col[np.abs(col)>3]

864   -3.331742
Name: 2, dtype: float64

- __To select all rows having a value exceeding 3 or –3, you can use the any method on a
boolean DataFrame:__

In [24]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
7    3.075076  0.270260 -0.659502  0.388007
42   0.056894 -1.337601 -0.776966 -3.133937
164 -2.239333  3.411398  0.103656  0.933392
320  0.748741 -3.043540  0.423652 -0.255932
821  3.325734  0.514552 -0.094404  0.431691
864  0.022212  0.591466 -3.331742  0.431040
880  0.231857 -3.307033  2.138216  1.513971

- __Values can be set based on these criteria. Here is code to cap values outside the inter‐
val –3 to 3:__

In [25]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.054565    -0.023542    -0.000790     0.010459
std       1.020762     1.032327     0.929550     1.030405
min      -2.864327    -3.000000    -3.000000    -3.000000
25%      -0.713493    -0.710143    -0.603772    -0.663430
50%      -0.049706    -0.051692    -0.006663     0.013526
75%       0.654988     0.654663     0.593711     0.726343
max       3.000000     3.000000     2.578913     2.817692

### Permutation and Random Sampling

- __Permuting (randomly reordering) a Series or the rows in a DataFrame is easy to do
using the 'numpy.random.permutation' function__

In [26]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [30]:
sampler = np.random.permutation(5)
sampler

array([2, 3, 4, 0, 1])

- __'take' method__

In [32]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19
0   0   1   2   3
1   4   5   6   7

- __'sample' method to take sample__

In [37]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
4  16  17  18  19

### Computing Indicator/Dummy Variables

- __Another type of transformation for statistical modeling or machine learning applications is converting a categorical variable into a “dummy” or “indicator” matrix__
- __If a column in a DataFrame has k distinct values, you would derive a matrix or DataFrame with k columns containing all 1s and 0s__
- __pandas have 'get_dummies' fucntion for doing this__

In [4]:
import pandas as pd

df = pd.DataFrame({
    'key': ['b', 'b', 'a', 'c', 'a', 'b'],
    'data1': range(6)
})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [3]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

- __in some cases, you want to add a prefix to the columns in the indicator DataFrmae, which can be merged with the other data.__
- __'get_dummies' has a prefix argument for doing it__

In [5]:
dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [6]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

- __If a row in a DataFrame belongs to multiple categories, things are bit more complicated__
- __Let's look at the MovieLens 1M dataset__

In [30]:
mnames = ['movie_id', 'title', 'genres']

In [33]:
movies = pd.read_table('ml-1m/movies.dat', sep='::', header=None, names=mnames)
movies[:10]

<ipython-input-33-dfefdf4fadb0>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table('ml-1m/movies.dat', sep='::', header=None, names=mnames)

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [36]:
all_genre = []

In [39]:
for i in movies.genres:
    all_genre.extend(i.split('|'))
    
pd.unique(all_genre)

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [ ]:
gen = movies.genres[0]
gen